## Отчет по лабораторной работе №2

### №1

**Задание**

Тимофей составляет 5-буквенные коды из букв Т, И, М, О, Ф, Е, Й. Буква Й может использоваться в коде не более одного раза, при этом она не может стоять на первом месте, на последнем месте и рядом с буквой И. Все остальные буквы могут встречаться произвольное количество раз или не встречаться совсем. Сколько различных кодов может составить Тимофей?

```python
from itertools import product

def count_codes():
    letters = "ТИМОФЕЙ"
    count = 0
    for x in product(letters, repeat=5):
        s = ''.join(x)
        if (s.count('Й') <= 1 and s[0] != 'Й' and s[-1] != 'Й' and 'ИЙ' not in s and 'ЙИ' not in s):
            count += 1
    
    return count

result = count_codes()
print(f"{result}")
```

**Результат**


**Описание проделанной работы**

---
### №2

**Задание**

Сколько единиц содержится в двоичной записи значения выражения \( 4 ^ {2020} + 2 ^ {2017} − 15 \)?

```python
def count_ones_in_binary():
    x = 4**2020 + 2**2017 - 15
    count = 0
    while x > 0:
        if x % 2 == 1:  
            count += 1
        x //= 2          
    return count

result = count_ones_in_binary()
print(f"Количество единиц {result}")
```

**Результат**



**Описание проделанной работы**

---
### №3

**Задание**

Найдите среди целых чисел, принадлежащих числовому отрезку \( [174457; 174505] \), числа, имеющие ровно два различных натуральных делителя, не считая единицы и самого числа. Для каждого найденного числа запишите эти два делителя в два соседних столбца на экране с новой строки в порядке возрастания произведения этих двух делителей. Делители в строке также должны следовать в порядке возрастания. Например, в диапазоне \( [5; 9] \) ровно два различных натуральных делителя имеют числа 6 и 8, поэтому для этого диапазона вывод на экран должен содержать следующие значения:
```
  2 3
  2 4
```

```python
def search_div(n):
    divisors = set()
    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            divisors.add(i)
            divisors.add(n//i)
        if len(divisors) > 2:
            break
    return divisors

for i in range(174457, 174506):
    d = sorted(search_div(i))
    if len(d) == 2:
        print(d[0], d[1])
```

**Результат**


**Описание проделанной работы**

---

  




